Asynchronicity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Asynchronous Practice</title>
<!-- 2015-06-04 Thu 13:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Clarissa Littler" />
</head>
<body>
<div id="content">
<h1 class="title">Asynchronous Practice</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document is going to include a series of examples and exercises for asynchronous programming using both the callback-style of asynchronicity and a promises library to make asynchronous code look more ordered. For these examples, you&rsquo;ll need to have Node installed first and, when you get to promises, run the command
</p>
<div class="org-src-container">

<pre class="src src-sh">npm install q
</pre>
</div>
<p>
before you start trying to run the code yourself. If you have another promises library you prefer go ahead and install that instead. 
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Synchronous vs. Asynchronous</h2>
<div class="outline-text-2" id="text-2">
<p>
We&rsquo;ll start with a brief overview of the idea of asynchronous programming. First, code is &ldquo;synchronous&rdquo; when only one thing is happening at a time. In terms of the <i>syntax</i> <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> of your code, it means that the program flow doesn&rsquo;t continue from one statement <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup> to the next until the previous statement is <b>completely</b> resolved. If it was a function call, then the function will <b>return</b> before the next line is executed, if the statement is a loop then the loop will be completely resolved before the first statement after it is executed. 
</p>

<p>
Almost all plain Javascript code you write is going to be synchronous by default. It&rsquo;s only when we add in libraries such as jQuery or Node that you&rsquo;ll be dealing with asynchronous code. Asynchronous really means that a statement is considered &ldquo;done&rdquo; and the code moves on even though the statement may still be processing. For example, consider the following code that uses the Node filesystem library to access the randomly generated gibberish file <code>rand.txt</code> in this directory. 
</p>

<div class="org-src-container">

<pre class="src src-js">fs = require(<span style="color: #EEDC82;">'fs'</span>); <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">here we load the filesystem module from Node</span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">file</span>;

fs.readFile(<span style="color: #EEDC82;">"rand.txt"</span>, <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">err</span>,<span style="color: #FD971F;">res</span>) {
    file = res;
});

console.log(file);
</pre>
</div>

<pre class="example">
undefined
</pre>

<p>
When we run this code, we&rsquo;ll print out <code>undefined</code>. Why? Because the callback <sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup> in our call to <code>readFile</code> is what sets <code>file</code> to be the contents of <code>rand.txt</code>. Since <code>readFile</code> is asynchronous, it means that we procede to <code>console.log(file)</code> <b>immediately</b> after the call to <code>readFile</code> rather than only after the reading of the file is done. Of course, the right way to do this would have been 
</p>

<div class="org-src-container">

<pre class="src src-js">fs = require(<span style="color: #EEDC82;">'fs'</span>);
fs.readFile(<span style="color: #EEDC82;">"rand.txt"</span>, <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">err</span>,<span style="color: #FD971F;">res</span>) {
    console.log(res.length);
});
</pre>
</div>

<pre class="example">
100000
</pre>

<p>
For convenience of output, we&rsquo;re actually just outputting the length of the file that was read in rather than the entire file.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Multiple Asynchronous Operations</h2>
<div class="outline-text-2" id="text-3">
<p>
The previous example was pretty simple: it was just a single callback. What if we wanted to do something a little bit more complicated? Let&rsquo;s consider a harder example that mimics the <code>cp</code> shell command. What we&rsquo;re going to write is a function that will 
</p>
<ul class="org-ul">
<li>read in a given file
</li>
<li>write that file to the target path
</li>
<li>perform an (optional) action when the write is finished
</li>
</ul>
<p>
and we will export this function use Node&rsquo;s module system
</p>

<p>
To start with we have our file <code>nodecopy.js</code>
</p>
<div class="org-src-container">

<pre class="src src-js">fs = require(<span style="color: #EEDC82;">'fs'</span>);
<span style="color: #F92672;">function</span> <span style="color: #A6E22E;">copy</span>(<span style="color: #FD971F;">file1</span>, <span style="color: #FD971F;">file2</span>, <span style="color: #FD971F;">callback</span>) {
    fs.readFile(file1, <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">err</span>, <span style="color: #FD971F;">res</span>) {
        <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">Now we're in the body of the callback that runs when readFile hsa finished</span>
        <span style="color: #F92672;">if</span> (err) {
            <span style="color: #F92672;">throw</span> err;
        }
        <span style="color: #F92672;">else</span> {
            <span style="color: #8C8C8C;">// </span><span style="color: #8C8C8C;">now we pass our top level callback into writeFile so that it executes</span>
            <span style="color: #8C8C8C;">// </span><span style="color: #8C8C8C;">whenever writeFile finishes</span>
            fs.writeFile(file2, res, callback);
        }
    });
}

module.exports = copy;
</pre>
</div>
<p>
and here we have a small program to test out our example called <code>copytest.js</code>
</p>
<div class="org-src-container">

<pre class="src src-js">copy = require(<span style="color: #EEDC82;">'./nodecopy.js'</span>);

copy(<span style="color: #EEDC82;">"rand.txt"</span>,<span style="color: #EEDC82;">"rand2.txt"</span>, <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">err</span>) {
    <span style="color: #F92672;">if</span> (err) {
        <span style="color: #F92672;">throw</span> err;
    }
    <span style="color: #F92672;">else</span> {
        console.log(<span style="color: #EEDC82;">"copied"</span>);
    }
});
</pre>
</div>

<p>
This was merely the simple case of multiple asynchronous operations because they clearly had a kind of linear ordering: the <code>writeFile</code> operation <b>could not happen</b> until after the <code>readFile</code> was done. We thus say that these operations happen <i>sequentially</i>, i.e. there is an ordering to them. What if we there wasn&rsquo;t necessarily an ordering? What if we could have something like multiple reads happening <b>at the same time</b>, that is <i>concurrently</i>?
</p>

<p>
For example, let&rsquo;s consider a fairly contrived example of a function that reads from a list of files and returned the name of the longest file of the list of files provided (yes, this is <b>very</b> contrived). The way this would work is that we&rsquo;re going to 
</p>

<ul class="org-ul">
<li>launch a separate <code>readFile</code> for-each file in the array called <code>files</code>
</li>
<li>in each <code>readFile</code> we have a callback that
<ul class="org-ul">
<li>takes the data that was in the file, <code>data</code>
</li>
<li>records the filename <b>and</b> the size of the file in the special <code>fileSizes</code> array
</li>
<li>checks to see if we&rsquo;re actually <b>done with all reads</b> with the comparison <code>counter == targetSize</code>
</li>
<li>if we&rsquo;re done with all of the reads, then we <b>sort</b> the array by the <code>.size</code> property of its elements
</li>
<li>after sorting, we pass the file name of the last element of <code>fileSizes</code> to the callback
</li>
</ul>
</li>
</ul>

<p>
filename: largest.js 
</p>
<div class="org-src-container">

<pre class="src src-js">fs = require(<span style="color: #EEDC82;">'fs'</span>);

module.exports = <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">files</span>, <span style="color: #FD971F;">callback</span>) {
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">targetSize</span> = files.length; <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">for convenience, we store the size of the list of files in a variable</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">fileSizes</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Array</span>(targetSize); <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">this is where we'll store our calculations about the sizes of all the files</span>
    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">counter</span> = 0; <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">this variable is for keeping track of how many of the files are finished being read. Once all of them have been read, we can finish our callback </span>
    files.forEach(<span style="color: #F92672;">function</span> (<span style="color: #FD971F;">f</span>,<span style="color: #FD971F;">i</span>) {
        fs.readFile(f, <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">err</span>,<span style="color: #FD971F;">data</span>) {
            <span style="color: #F92672;">if</span> (err) {
                <span style="color: #F92672;">throw</span> err;
            }
            <span style="color: #F92672;">else</span> {
                fileSizes[i] = {file : f, size: data.length};
                counter = counter+1;
                <span style="color: #F92672;">if</span> (counter == targetSize) { 
                    <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">if all our concurrent reads are done, figure out what the largest file is</span>
                    <span style="color: #8C8C8C;">//</span><span style="color: #8C8C8C;">and pass that name into the callback</span>
                    fileSizes.sort(<span style="color: #F92672;">function</span> (<span style="color: #FD971F;">a</span>,<span style="color: #FD971F;">b</span>) { <span style="color: #F92672;">return</span> ( a.size - b.size)});
                    callback(fileSizes[targetSize-1].file);
                }
            }
        });
    })
}
</pre>
</div>

<p>
and we can test it with the following program
</p>

<div class="org-src-container">

<pre class="src src-js">largest = require(<span style="color: #EEDC82;">'./largest'</span>);

<span style="color: #F92672;">var</span> <span style="color: #FD971F;">files</span> = [<span style="color: #EEDC82;">"rand.txt"</span>,<span style="color: #EEDC82;">"rand2.txt"</span>,<span style="color: #EEDC82;">"rand3.txt"</span>]

largest(files, <span style="color: #F92672;">function</span> (<span style="color: #FD971F;">name</span>) {console.log(name);});
</pre>
</div>

<p>
and this should print out <code>rand3.txt</code>!
</p>

<p>
How did this program work, though? It worked by the principle of &ldquo;counting callbacks&rdquo;. The basic idea is that if we have a number of asynchronous <b>concurrent</b> operations, there is going to be one operation that finishes last. We can&rsquo;t predict which one, though, because we don&rsquo;t know in advance which operations are necessarily going to take the longest. Instead, we need to give each callback the ability to check &ldquo;am I the last to finish?&rdquo; and, if they are, they can then finish the job for all of them.
</p>

<p>
In our very simple case, the &ldquo;am I last?&rdquo; check is seeing if, after incrementing the counter, the counter is equal to the number of asynchronous calls that were made, then clearly everyone else has already finished their work and it is thus the responsibility of the <b>last</b> asynchronous call to process everything that all the other calls have done.
</p>

<p>
Here&rsquo;s an analogy: imagine if you and your friends were going to vote on where to go for a big road trip. You set aside a box to put your votes in and everyone can just write their vote on a slip of paper and put it in the box. You and your friends prefer to handle things anarchistically, so rather than have a single person in charge of the ballots you just agree that whoever is last has to be the one to count up the votes. How do you know you&rsquo;re last, though? The easiest way is to just count up the number of votes in the ballot and, when it&rsquo;s equal to the number of friends who were voting, then you know the voting is done. This means, though, that each person needs to count the ballots whenever they vote to see if they&rsquo;re the last one. 
</p>

<p>
On the other hand, our previous example that involve <b>nested</b> callbacks is more like passing around an attendance sheet in a classroom. The lecture can start without the entire sheet having been signed first (i.e. it&rsquo;s an <i>asynchronous</i> operation), but it&rsquo;s being passed around from one student to the other in an ordered, <i>sequential</i> manner. Whenever a student is passed the sign-in sheet, they have an action to take when they&rsquo;re done signing (i.e. a callback) to pass it to the next student or, if they are the last student, to put it on the lecturer&rsquo;s desk.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Exercises</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Concatenate</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Based on our &ldquo;copy&rdquo; function, write a function that will
</p>
<ul class="org-ul">
<li>take in four arguments
<ul class="org-ul">
<li>two input file paths, file1 and file2
</li>
<li>an output file path, fileout
</li>
<li>a callback, callback
</li>
</ul>
</li>
<li>concatenate the contents of file2 to the end of the contents of file1
</li>
<li>write the result into fileout
</li>
<li>call callback <b>only if</b> the write is finished
</li>
</ul>

<p>
Test your function on two small files and check to see that it works correctly. You may have this function read the two files either <i>sequentially</i> <b>or</b> <i>concurrently</i>.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Concatenate Arbitrary</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Based on the previous problem and our examples of <i>ordered</i>, <i>concurrent</i> reads create a function that will
</p>
<ul class="org-ul">
<li>take in three arguments
<ul class="org-ul">
<li>an <b>array</b> of file paths
</li>
<li>an output file path
</li>
<li>a callback
</li>
</ul>
</li>
<li>concatenate the contents of all of the files provided in the array, <b>in order</b>
</li>
<li>write the result into the output file path
</li>
<li>call the callback only once the write is completed
</li>
</ul>

<p>
You&rsquo;ll need to practice callback counting in this exercise in order to have all of the <code>readFile</code> operations happen concurrently
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Promises, Promises</h2>
<div class="outline-text-2" id="text-4">
<p>
So as we&rsquo;ve seen, having a number of sequential asynchronous operations can be a bit ugly because we&rsquo;re having to nest callbacks inside other callbacks. It can obscure the inherent simplicity in what the code is actually doing.
</p>

<p>
Promises are an attempt to provide a much cleaner interface to allow you to chain sequential, but still possibily asynchronous, events. In other words, promises are meant to simplify the case of passing the attendance sheet around the room. 
</p>

<p>
<b>The rest of this section is still to be filled out soon</b>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
I&rsquo;m not sure if this has been made explicit, but the actual <b>text</b> of your program is called the <i>syntax</i>, but the <b>behavior</b> of your program is the <i>semantics</i>. Every programming language has a distinct syntax and semantics, though sometimes the semantics is not well-defined and is presented more as &ldquo;what this implementation of the programming language does&rdquo;. For example, Javascript doesn&rsquo;t have a formally defined semantics (yet) but implementations agree close enough on What Javascript Means that this isn&rsquo;t a problem.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<i>Statements</i> being things like 
</p>
<ul class="org-ul">
<li>variables assignments
</li>
<li>loops
</li>
<li>function declarations
</li>
<li>an expression that is by itself on a single line followed by a semi-colon
<ul class="org-ul">
<li><code>5</code> is an expression <code>5;</code> is a statement
</li>
</ul>
</li>
</ul></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
Alright, this is a little bit of a rant on my part. I don&rsquo;t like the generic term &ldquo;callback&rdquo; in Javascript-culture. In asynchronous programming, we are doing <b>actual</b> callbacks: functions that are run only after the end of some asynchronous operation. Calling things like the function argument to <code>.forEach</code> a callback I think muddies the waters. Javascript, unlike many early programming languages such as C and its descendants, allows you to easily pass functions as arguments to other functions. Calling an argument that happens to be a function a new term such as callback makes it seem like there&rsquo;s some special difference between functions and any other kind of value. There really isn&rsquo;t! Javascript is a &ldquo;functional&rdquo; language in the sense that functions are ordinary values like any other.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Clarissa Littler</p>
<p class="date">Created: 2015-06-04 Thu 13:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
